In [1]:
import pandas as pd
import numpy as np

In [2]:

date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [7]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [12]:
date['date_year'] = date['date'].dt.year
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
966 2019-11-17        5975       18       1       2019          11
576 2019-10-11         202        2       3       2019          10
569 2019-02-18        5795       14       4       2019           2
297 2019-12-02        5653       17       4       2019          12
81  2019-03-22        3143       25       1       2019           3

In [16]:
date['date_month'] = date['date'].dt.month
date['dath_month_name'] = date['date'].dt.month_name() 
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,dath_month_name
871,2018-12-26,7378,21,8,2018,12,December
620,2019-03-21,3220,28,1,2019,3,March
697,2019-10-10,3582,26,2,2019,10,October
600,2019-10-18,3464,0,2,2019,10,October
423,2019-08-14,5670,28,1,2019,8,August

In [17]:
date['date_day'] = date['date'].dt.day
date['dath_dow'] = date['date'].dt.dayofweek
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,dath_month_name,date_day,dath_dow
598,2018-09-07,1134,13,19,2018,9,September,7,4
36,2018-07-13,3432,13,28,2018,7,July,13,4
726,2019-10-20,5794,6,1,2019,10,October,20,6
433,2019-08-15,5770,14,1,2019,8,August,15,3
102,2018-08-30,3328,29,1,2018,8,August,30,3

In [18]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,dath_month_name,date_day,dath_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [20]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,dath_month_name,date_day,dath_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

Extract week of the year

In [23]:
# date['date_week'] = date['date'].dt.weak
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,dath_month_name,date_day,dath_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

extract quater

date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

In [ ]:
extract semester

In [25]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,dath_month_name,date_day,dath_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

Extract Time elapsed between dates

In [26]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 1, 16, 14, 49, 56, 350690)

In [27]:
today - date['date']

0     2229 days 14:49:56.350690
1     2711 days 14:49:56.350690
2     2642 days 14:49:56.350690
3     2344 days 14:49:56.350690
4     2567 days 14:49:56.350690
                 ...
995   2657 days 14:49:56.350690
996   2598 days 14:49:56.350690
997   2446 days 14:49:56.350690
998   2511 days 14:49:56.350690
999   2285 days 14:49:56.350690
Name: date, Length: 1000, dtype: timedelta64[ns]

In [28]:
(today - date['date']).dt.days

0      2229
1      2711
2      2642
3      2344
4      2567
       ...
995    2657
996    2598
997    2446
998    2511
999    2285
Name: date, Length: 1000, dtype: int64

In [30]:
# Months passed

np.round((today -date['date']) / np.timedelta64(30, 'D'),0)

0      74.0
1      90.0
2      88.0
3      78.0
4      86.0
       ...
995    89.0
996    87.0
997    82.0
998    84.0
999    76.0
Name: date, Length: 1000, dtype: float64

In [33]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [34]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [37]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.drop(columns = ['msg']).head()

                 date  hour  min  sec
0 2013-12-15 00:50:00     0   50    0
1 2014-04-29 23:40:00    23   40    0
2 2012-12-30 00:21:00     0   21    0
3 2014-11-28 00:31:00     0   31    0
4 2013-10-26 23:11:00    23   11    0

In [38]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [39]:
today - time['date']

0     4415 days 13:59:56.350690
1     4279 days 15:09:56.350690
2     4765 days 14:28:56.350690
3     4067 days 14:18:56.350690
4     4464 days 15:38:56.350690
                 ...
995   5054 days 13:59:56.350690
996   4375 days 15:35:56.350690
997   4840 days 15:12:56.350690
998   4956 days 15:15:56.350690
999   4228 days 15:24:56.350690
Name: date, Length: 1000, dtype: timedelta64[ns]

In [40]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.815064e+08
1      3.697602e+08
2      4.117481e+08
3      3.514403e+08
4      3.857459e+08
           ...
995    4.367160e+08
996    3.780562e+08
997    4.182308e+08
998    4.282534e+08
999    3.653547e+08
Name: date, Length: 1000, dtype: float64

In [41]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.358440e+06
1      6.162670e+06
2      6.862469e+06
3      5.857339e+06
4      6.429099e+06
           ...
995    7.278600e+06
996    6.300936e+06
997    6.970513e+06
998    7.137556e+06
999    6.089245e+06
Name: date, Length: 1000, dtype: float64

In [42]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      105973.998986
1      102711.165653
2      114374.482320
3       97622.315653
4      107151.648986
           ...
995    121309.998986
996    105015.598986
997    116175.215653
998    118959.265653
999    101487.415653
Name: date, Length: 1000, dtype: float64